In [192]:
import pandas as pd

In [2]:
import numpy as np
import pandas as pd
import os
import matplotlib.pyplot as plt
%matplotlib inline

In [3]:
titanic_train = pd.read_csv("https://gist.githubusercontent.com/michhar/2dfd2de0d4f8727f873422c5d959fff5/raw/ff414a1bcfcba32481e4d4e8db578e55872a2ca1/titanic.csv",sep='\t')   
titanic_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
#there is two way to to extract column
titanic_train.Age
#titanic_train['Age']

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
151    22.0
152    55.5
153    40.5
154     NaN
155    51.0
Name: Age, Length: 156, dtype: float64

In [196]:
# difference b\w series & dataframe
titanic_train['Age'] # this is series
titanic_train[['Age']] # this is dataframe

      Age
0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
..    ...
151  22.0
152  55.5
153  40.5
154   NaN
155  51.0

[156 rows x 1 columns]

In [197]:
titanic_train.tail(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
146,147,1,3,"Andersson, Mr. August Edvard (""Wennerstrom"")",male,27.0,0,0,350043,7.7958,NaN,S
147,148,0,3,"Ford, Miss. Robina Maggie ""Ruby""",female,9.0,2,2,W./C. 6608,34.3750,NaN,S
148,149,0,2,"Navratil, Mr. Michel (""Louis M Hoffman"")",male,36.5,0,2,230080,26.0000,F2,S
149,150,0,2,"Byles, Rev. Thomas Roussel Davids",male,42.0,0,0,244310,13.0000,NaN,S
150,151,0,2,"Bateman, Rev. Robert James",male,51.0,0,0,S.O.P. 1166,12.5250,NaN,S
151,152,1,1,"Pears, Mrs. Thomas (Edith Wearne)",female,22.0,1,0,113776,66.6000,C2,S
152,153,0,3,"Meo, Mr. Alfonzo",male,55.5,0,0,A.5. 11206,8.0500,NaN,S
153,154,0,3,"van Billiard, Mr. Austin Blyler",male,40.5,0,2,A/5. 851,14.5000,NaN,S
154,155,0,3,"Olsen, Mr. Ole Martin",male,NaN,0,0,Fa 265302,7.3125,NaN,S
155,156,0,1,"Williams, Mr. Charles Duane",male,51.0,0,1,PC 17597,61.3792,NaN,C

In [198]:
titanic_train.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [199]:
titanic_train.describe(include='object')

                       Name   Sex  Ticket Cabin Embarked
count                   156   156     156    31      155
unique                  156     2     145    28        3
top     Icard, Miss. Amelie  male  113803  C123        S
freq                      1   100       2     2      110

In [6]:
list_col = titanic_train.dtypes[titanic_train.dtypes == "object"].index
titanic_train[list_col].describe()

                           Name   Sex      Ticket        Cabin Embarked
count                       156   156         156           31      155
unique                      156     2         145           28        3
top     Dean, Mr. Bertram Frank  male  W./C. 6608  C23 C25 C27        S
freq                          1   100           2            2      110

In [8]:
a=titanic_train.dtypes[titanic_train.dtypes=='object'].index
a

Index(['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked'], dtype='object')

In [201]:
titanic_train[['Name','Sex','Age']]

                                                  Name     Sex   Age
0                              Braund, Mr. Owen Harris    male  22.0
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0
2                               Heikkinen, Miss. Laina  female  26.0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0
4                             Allen, Mr. William Henry    male  35.0
..                                                 ...     ...   ...
151                  Pears, Mrs. Thomas (Edith Wearne)  female  22.0
152                                   Meo, Mr. Alfonzo    male  55.5
153                    van Billiard, Mr. Austin Blyler    male  40.5
154                              Olsen, Mr. Ole Martin    male   NaN
155                        Williams, Mr. Charles Duane    male  51.0

[156 rows x 3 columns]

In [202]:
sorted(titanic_train["Name"])[5:10:2]# Check the first 15 sorted names

['Andersson, Mr. August Edvard ("Wennerstrom")',
 'Andrew, Mr. Edgardo Samuel',
 'Asplund, Mrs. Carl Oscar (Selma Augusta Emilia Johansson)']

In [203]:
titanic_train[['Name']].sort_values(by = 'Name')[0:15:2]

                                               Name
40   Ahlin, Mrs. Johan (Johanna Persdotter Larsson)
119               Andersson, Miss. Ellis Anna Maria
13                      Andersson, Mr. Anders Johan
91                       Andreasson, Mr. Paul Edvin
49    Arnold-Franchi, Mrs. Josef (Josefine Franchi)
114                           Attalah, Miss. Malake
112                          Barton, Mr. David John
118                        Baxter, Mr. Quigg Edmond

In [204]:
titanic_train["Name"].describe()

count                     156
unique                    156
top       Icard, Miss. Amelie
freq                        1
Name: Name, dtype: object

In [205]:
titanic_train[["Ticket"]][4:9]

   Ticket
4  373450
5  330877
6   17463
7  349909
8  347742

In [206]:
titanic_train[["Ticket"]].describe()

        Ticket
count      156
unique     145
top     113803
freq         2

In [207]:
#creating a new column by item assign method
titanic_train["sudh"]="sdffs"
titanic_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,sudh
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,sdffs
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,sdffs
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,sdffs
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,sdffs
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,sdffs

In [208]:
titanic_train["Cabin"][0:15]       # Check the first 15 tickets

0      NaN
1      C85
2      NaN
3     C123
4      NaN
5      NaN
6      E46
7      NaN
8      NaN
9      NaN
10      G6
11    C103
12     NaN
13     NaN
14     NaN
Name: Cabin, dtype: object

In [209]:
titanic_train['Sex'].unique() #give the name of unique value

array(['male', 'female'], dtype=object)

In [210]:
titanic_train['Sex'].nunique() #give the no. of unique value

2

In [211]:
titanic_train.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
sudh            object
dtype: object

In [212]:
titanic_train[["Survived"]].head(1)

   Survived
0         0

In [213]:
titanic_train.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked', 'sudh'],
      dtype='object')

In [214]:
titanic_train.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,156.000000,156.000000,156.000000,126.000000,156.000000,156.000000,156.000000
mean,78.500000,0.346154,2.423077,28.141508,0.615385,0.397436,28.109587
std,45.177428,0.477275,0.795459,14.613880,1.056235,0.870146,39.401047
min,1.000000,0.000000,1.000000,0.830000,0.000000,0.000000,6.750000
25%,39.750000,0.000000,2.000000,19.000000,0.000000,0.000000,8.003150
50%,78.500000,0.000000,3.000000,26.000000,0.000000,0.000000,14.454200
75%,117.250000,1.000000,3.000000,35.000000,1.000000,0.000000,30.371850
max,156.000000,1.000000,3.000000,71.000000,5.000000,5.000000,263.000000

In [215]:
#no. of unique value
new_Pclass = pd.Categorical(titanic_train["Pclass"])

new_Pclass

[3, 1, 3, 1, 3, ..., 1, 3, 3, 3, 1]
Length: 156
Categories (3, int64): [1, 2, 3]

In [216]:
titanic_train['Pclass'].unique()

array([3, 1, 2], dtype=int64)

In [217]:
titanic_train["Cabin"].unique()   # Check unique cabins

array([nan, 'C85', 'C123', 'E46', 'G6', 'C103', 'D56', 'A6',
       'C23 C25 C27', 'B78', 'D33', 'B30', 'C52', 'B28', 'C83', 'F33',
       'F G73', 'E31', 'A5', 'D10 D12', 'D26', 'C110', 'B58 B60', 'E101',
       'F E69', 'D47', 'B86', 'F2', 'C2'], dtype=object)

In [218]:
#change the name of class in categorical 
a=titanic_train['Cabin'].astype(str)
l=[]
for i in a:
    l.append(i[0])
new=pd.Categorical(l)
new

[n, C, n, C, n, ..., C, n, n, n, n]
Length: 156
Categories (8, object): [A, B, C, D, E, F, G, n]

In [219]:
import numpy as np 
char_cabin = titanic_train["Cabin"].astype(str) # Convert data to str

new_Cabin = [cabin[0] for cabin in char_cabin] # Take first letter

new_Cabin = pd.Categorical(new_Cabin)
titanic_train["Cabin"] = new_Cabin
titanic_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,sudh
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,n,S,sdffs
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C,C,sdffs
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,n,S,sdffs
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C,S,sdffs
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,n,S,sdffs

In [220]:
# rename of categories in object data types
new=pd.Categorical(titanic_train['Survived'])
new.rename_categories(['dead','alive'])

[dead, alive, alive, alive, dead, ..., alive, dead, dead, dead, dead]
Length: 156
Categories (2, object): [dead, alive]

In [221]:
#checking the null data in the particular column
titanic_train["Age"].isnull()
titanic_train["Age"].isnull().sum()

30

In [222]:
#checking the total no. of NaN present in the dataframe in one shot(use any one method)
titanic_train.isnull().sum()
titanic_train.isna().sum()

PassengerId     0
Survived        0
Pclass          0
Name            0
Sex             0
Age            30
SibSp           0
Parch           0
Ticket          0
Fare            0
Cabin           0
Embarked        1
sudh            0
dtype: int64

In [223]:
#np.where() method give the indexes 
missing = np.where(titanic_train["Age"].isnull() == False)
titanic_train.iloc[missing]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,sudh
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,n,S,sdffs
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C,C,sdffs
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,n,S,sdffs
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C,S,sdffs
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,n,S,sdffs
...,...,...,...,...,...,...,...,...,...,...,...,...,...
150,151,0,2,"Bateman, Rev. Robert James",male,51.0,0,0,S.O.P. 1166,12.5250,n,S,sdffs
151,152,1,1,"Pears, Mrs. Thomas (Edith Wearne)",female,22.0,1,0,113776,66.6000,C,S,sdffs
152,153,0,3,"Meo, Mr. Alfonzo",male,55.5,0,0,A.5. 11206,8.0500,n,S,sdffs
153,154,0,3,"van Billiard, Mr. Austin Blyler",male,40.5,0,2,A/5. 851,14.5000,n,S,sdffs
155,156,0,1,"Williams, Mr. Charles Duane",male,51.0,0,1,PC 17597,61.3792,n,C,sdffs

In [224]:
#findig the index where fare is maximum
titanic_train.iloc[np.where(titanic_train["Fare"]==max(titanic_train["Fare"]))]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,sudh
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.0,C,S,sdffs
88,89,1,1,"Fortune, Miss. Mabel Helen",female,23.0,3,2,19950,263.0,C,S,sdffs

In [225]:
titanic_train.iloc[np.where(titanic_train['Fare']==min(titanic_train['Fare']))]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,sudh
143,144,0,3,"Burke, Mr. Jeremiah",male,19.0,0,0,365222,6.75,n,Q,sdffs

In [226]:
missing=np.where(titanic_train['Survived'].isnull()==True)
titanic_train.loc[missing]

Empty DataFrame
Columns: [PassengerId, Survived, Pclass, Name, Sex, Age, SibSp, Parch, Ticket, Fare, Cabin, Embarked, sudh]
Index: []

In [227]:
len(missing[0])

0

In [228]:
#adding (concating) columns
titanic_train["Family"] = titanic_train["SibSp"] + titanic_train["Parch"]
titanic_train["Family"]
most_family = np.where(titanic_train["Family"] == max(titanic_train["Family"]))
titanic_train.loc[most_family]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,sudh,Family
59,60,0,3,"Goodwin, Master. William Frederick",male,11.0,5,2,CA 2144,46.9,n,S,sdffs,7
71,72,0,3,"Goodwin, Miss. Lillian Amy",female,16.0,5,2,CA 2144,46.9,n,S,sdffs,7

In [229]:
titanic_train["Family"] = titanic_train["SibSp"] + titanic_train["Parch"]

most_family = np.where(titanic_train["Family"] == max(titanic_train["Family"]))
most_family
titanic_train.iloc[most_family]['Sex']

59      male
71    female
Name: Sex, dtype: object

In [230]:
import numpy as np
import pandas as pd

labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10,'b':20,'c':30}

print ("Labels:", labels)
print("My data:", my_data)
print("Dictionary:", d)
pd.Series(my_data, index=labels)

Labels: ['a', 'b', 'c']
My data: [10, 20, 30]
Dictionary: {'a': 10, 'b': 20, 'c': 30}

a    10
b    20
c    30
dtype: int64

In [231]:
pd.Series(my_data, index=labels)

a    10
b    20
c    30
dtype: int64

In [232]:
print ("\nHolding numerical data\n",'-'*25, sep='')
print(pd.Series(arr)[1])

Holding numerical data
-------------------------
20

In [233]:
print ("\nHolding text labels\n",'-'*20, sep='')
print(pd.Series(labels))

Holding text labels
--------------------
0    a
1    b
2    c
dtype: object

In [234]:

d = {'a':"kjhk",'b':20,'c':30}
d.items
pd.DataFrame(d,index = ['a','b','c'])

      a   b   c
a  kjhk  20  30
b  kjhk  20  30
c  kjhk  20  30

In [235]:
print ("\nHolding objects from a dictionary\n",'-'*40, sep='')
print(pd.Series([type, sum, max]))

Holding objects from a dictionary
----------------------------------------
0             <class 'type'>
1    <built-in function sum>
2    <built-in function max>
dtype: object

In [236]:
ser1 = pd.Series([1,2,3,4],index = [2,4,6,8])
ser2 = pd.Series([1,2,5,4],['CA', 'OR', 'NV', 'AZ'])
ser1

2    1
4    2
6    3
8    4
dtype: int64

In [237]:
ser1[0:3:2]

2    1
6    3
dtype: int64

In [238]:
print ("\nIndexing by number (positional value in the series)\n",'-'*52, sep='')
print("Value for CA in ser1:", ser1[6])
print("Value for AZ in ser1:", ser1[4])
print("Value for NV in ser1:", ser1[8])
ser1

Indexing by number (positional value in the series)
----------------------------------------------------
Value for CA in ser1: 3
Value for AZ in ser1: 2
Value for NV in ser1: 4

2    1
4    2
6    3
8    4
dtype: int64

In [239]:
print ("\nIndexing by a range\n",'-'*25, sep='')
print ("Value for OR, CO, and AZ in ser1:\n", ser1[0:3:2], sep='')

Indexing by a range
-------------------------
Value for OR, CO, and AZ in ser1:
2    1
6    3
dtype: int64

In [240]:
ser1 = pd.Series([1,2,3,4],['CA', 'OR', 'CO', 'CA'])
ser2 = pd.Series([1,2,5,4],['CA', 'NV', 'AZ','OR'])
ser3 = ser1+ser2
ser3

AZ    NaN
CA    2.0
CA    5.0
CO    NaN
NV    NaN
OR    6.0
dtype: float64

In [241]:
print ("\nAfter adding the two series, the result looks like this...\n",'-'*59, sep='')
print(ser3)
print("\nPython tries to add values where it finds common index name, and puts NaN where indices are missing\n")

After adding the two series, the result looks like this...
-----------------------------------------------------------
AZ    NaN
CA    2.0
CA    5.0
CO    NaN
NV    NaN
OR    6.0
dtype: float64

Python tries to add values where it finds common index name, and puts NaN where indices are missing

In [242]:
print ("\nThe idea works even for multiplication...\n",'-'*43, sep='')
print (ser1*ser2)

The idea works even for multiplication...
-------------------------------------------
AZ    NaN
CA    1.0
CA    4.0
CO    NaN
NV    NaN
OR    8.0
dtype: float64

In [243]:
from numpy.random import randn as rn
#np.random.seed(101)
matrix_data = rn(5,4)
row_labels = ['A','B','C','D','E']
column_headings = ['W','X','Y','Z']

df = pd.DataFrame(matrix_data,row_labels,column_headings)
#print("\nThe data frame looks like\n",'-'*45, sep='')

df

          W         X         Y         Z
A -2.220948  0.912652 -1.345978 -1.220001
B  0.091789 -0.638768  0.114401 -0.253830
C -0.083724 -0.669868 -0.833213  0.615165
D -1.951780  1.020656 -1.409411 -0.504308
E -0.117213 -1.058815 -0.376408  2.376546

In [244]:
df.loc['A','X'] #it takes labels
df.iloc[2,3] #it takes index

0.6151653301399965

In [245]:
print("\nType of the pair of columns: ", type(df[['X','Z']]), sep='')
print ("\nSo, for more than one column, the object turns into a DataFrame")

Type of the pair of columns: <class 'pandas.core.frame.DataFrame'>

So, for more than one column, the object turns into a DataFrame

In [246]:
print("\nThe 'X' column accessed by DOT method (NOT recommended)\n",'-'*55, sep='')
print(df["X"])
print(df.X)

The 'X' column accessed by DOT method (NOT recommended)
-------------------------------------------------------
A    0.912652
B   -0.638768
C   -0.669868
D    1.020656
E   -1.058815
Name: X, dtype: float64
A    0.912652
B   -0.638768
C   -0.669868
D    1.020656
E   -1.058815
Name: X, dtype: float64

In [247]:
print("\nA column is created by assigning it in relation to an existing column\n",'-'*75, sep='')
df['New'] = df['X']+df['Z']
df['New (Sum of X and Z)'] = df['X']+df['Z']
print(df)

A column is created by assigning it in relation to an existing column
---------------------------------------------------------------------------
          W         X         Y         Z       New  New (Sum of X and Z)
A -2.220948  0.912652 -1.345978 -1.220001 -0.307349             -0.307349
B  0.091789 -0.638768  0.114401 -0.253830 -0.892598             -0.892598
C -0.083724 -0.669868 -0.833213  0.615165 -0.054703             -0.054703
D -1.951780  1.020656 -1.409411 -0.504308  0.516348              0.516348
E -0.117213 -1.058815 -0.376408  2.376546  1.317732              1.317732

In [248]:
df.iloc[3,4]

0.5163477573667906

In [249]:
print("\nA column is dropped by using df.drop() method\n",'-'*55, sep=' ')
df.drop("C",inplace=True) # Notice the axis=1 option, axis = 0 is default, so one has to change it to 1

A column is dropped by using df.drop() method
 -------------------------------------------------------

In [250]:
df

          W         X         Y         Z       New  New (Sum of X and Z)
A -2.220948  0.912652 -1.345978 -1.220001 -0.307349             -0.307349
B  0.091789 -0.638768  0.114401 -0.253830 -0.892598             -0.892598
D -1.951780  1.020656 -1.409411 -0.504308  0.516348              0.516348
E -0.117213 -1.058815 -0.376408  2.376546  1.317732              1.317732

In [251]:
df.iloc[1:3,1:4]

          X         Y         Z
B -0.638768  0.114401 -0.253830
D  1.020656 -1.409411 -0.504308

In [252]:
df1=df.drop('A',axis=0,inplace=True)
print("\nA row (index) is dropped by using df.drop() method and axis=0\n",'-'*65, sep='')
print(df1)

A row (index) is dropped by using df.drop() method and axis=0
-----------------------------------------------------------------
None

In [253]:
print("\nAn in-place change can be done by making inplace=True in the drop method\n",'-'*75, sep='')
df.drop('New (Sum of X and Z)', axis=1, inplace=True)
print(df)

An in-place change can be done by making inplace=True in the drop method
---------------------------------------------------------------------------
          W         X         Y         Z       New
B  0.091789 -0.638768  0.114401 -0.253830 -0.892598
D -1.951780  1.020656 -1.409411 -0.504308  0.516348
E -0.117213 -1.058815 -0.376408  2.376546  1.317732

In [254]:
### Selecting/indexing Rows
#* Label-based 'loc' method
#* Index (numeric) 'iloc' method
df

          W         X         Y         Z       New
B  0.091789 -0.638768  0.114401 -0.253830 -0.892598
D -1.951780  1.020656 -1.409411 -0.504308  0.516348
E -0.117213 -1.058815 -0.376408  2.376546  1.317732

In [255]:
print("\nLabel-based 'loc' method can be used for selecting row(s)\n",'-'*60, sep='')
print("\nSingle row\n")
print(df.iloc[2])

Label-based 'loc' method can be used for selecting row(s)
------------------------------------------------------------

Single row

W     -0.117213
X     -1.058815
Y     -0.376408
Z      2.376546
New    1.317732
Name: E, dtype: float64

In [256]:
print("\nMultiple rows\n")
print(df.loc[['B','E']])

Multiple rows

          W         X         Y         Z       New
B  0.091789 -0.638768  0.114401 -0.253830 -0.892598
E -0.117213 -1.058815 -0.376408  2.376546  1.317732

In [257]:
print("\nIndex position based 'iloc' method can be used for selecting row(s)\n",'-'*70, sep='')
print("\nSingle row\n")
print(df.iloc[2])

Index position based 'iloc' method can be used for selecting row(s)
----------------------------------------------------------------------

Single row

W     -0.117213
X     -1.058815
Y     -0.376408
Z      2.376546
New    1.317732
Name: E, dtype: float64

In [258]:
print("\nMultiple rows\n")
print(df.iloc[[1,2]])

Multiple rows

          W         X         Y         Z       New
D -1.951780  1.020656 -1.409411 -0.504308  0.516348
E -0.117213 -1.058815 -0.376408  2.376546  1.317732

In [259]:
#### Subsetting DataFrame

In [260]:

matrix_data = rn(5,4)
row_labels = ['A','B','C','D','E']
column_headings = ['W','X','Y','Z']
df = pd.DataFrame(data=matrix_data, index=row_labels, columns=column_headings)

In [261]:
print("\nThe DatFrame\n",'-'*45, sep='')
print(df)

The DatFrame
---------------------------------------------
          W         X         Y         Z
A -0.853432 -0.403065  0.058084 -0.999583
B -2.672085 -1.209809 -0.691002 -0.304498
C -1.371557  0.624917 -0.152074 -1.055889
D -1.255151  0.251152 -1.591941 -1.328845
E -0.054341 -0.052988  0.307578 -1.140770

In [262]:
print("\nElement at row 'B' and column 'Y' is\n") 
print(df.loc[['B','C'],['Y','W']])

Element at row 'B' and column 'Y' is

          Y         W
B -0.691002 -2.672085
C -0.152074 -1.371557

In [263]:
print("\nSubset comprising of rows B and D, and columns W and Y, is\n")
df.iloc[[1,2,3],[0,1]]

Subset comprising of rows B and D, and columns W and Y, is

          W         X
B -2.672085 -1.209809
C -1.371557  0.624917
D -1.255151  0.251152

In [264]:
print(df.loc[['B','C'],])

          W         X         Y         Z
B -2.672085 -1.209809 -0.691002 -0.304498
C -1.371557  0.624917 -0.152074 -1.055889

### data frame wise filter

In [265]:
print("\nThe DataFrame\n",'-'*45, sep='')
print(df)

The DataFrame
---------------------------------------------
          W         X         Y         Z
A -0.853432 -0.403065  0.058084 -0.999583
B -2.672085 -1.209809 -0.691002 -0.304498
C -1.371557  0.624917 -0.152074 -1.055889
D -1.255151  0.251152 -1.591941 -1.328845
E -0.054341 -0.052988  0.307578 -1.140770

In [266]:
print("\nBoolean DataFrame(s) where we are checking if the values are greater than 0\n",'-'*75, sep='')
print(df>0)

Boolean DataFrame(s) where we are checking if the values are greater than 0
---------------------------------------------------------------------------
       W      X      Y      Z
A  False  False   True  False
B  False  False  False  False
C  False   True  False  False
D  False   True  False  False
E  False  False   True  False

In [267]:
df[df>1]

    W   X   Y   Z
A NaN NaN NaN NaN
B NaN NaN NaN NaN
C NaN NaN NaN NaN
D NaN NaN NaN NaN
E NaN NaN NaN NaN

In [299]:
df[df.iloc[:3,:2]>0]

    Age  Height  Weight Profession
A  22.0    66.0     NaN        NaN
B  42.0    70.0     NaN        NaN
C  30.0    62.0     NaN        NaN
D   NaN     NaN     NaN        NaN
E   NaN     NaN     NaN        NaN

In [269]:
print("\n")
print(df.loc[['A','B','C']]>0)

       W      X      Y      Z
A  False  False   True  False
B  False  False  False  False
C  False   True  False  False

In [270]:
booldf = df>0
print("\nDataFrame indexed by boolean dataframe\n",'-'*45, sep='')
print(df[booldf])

DataFrame indexed by boolean dataframe
---------------------------------------------
    W         X         Y   Z
A NaN       NaN  0.058084 NaN
B NaN       NaN       NaN NaN
C NaN  0.624917       NaN NaN
D NaN  0.251152       NaN NaN
E NaN       NaN  0.307578 NaN

In [271]:

import pandas as pd 
import numpy as np
matrix_data = np.matrix('22,66,140;42,70,148;30,62,125;35,68,160;25,62,152')
row_labels = ['A','B','C','D','E']
column_headings = ['Age', 'Height', 'Weight']
matrix_data

matrix([[ 22,  66, 140],
        [ 42,  70, 148],
        [ 30,  62, 125],
        [ 35,  68, 160],
        [ 25,  62, 152]])

In [272]:
df = pd.DataFrame(data=matrix_data, index=row_labels, columns=column_headings)
print("\nA new DataFrame\n",'-'*25, sep='')
print(df)

A new DataFrame
-------------------------
   Age  Height  Weight
A   22      66     140
B   42      70     148
C   30      62     125
D   35      68     160
E   25      62     152

### column wise filter

In [273]:
df[df['Height']>65]

   Age  Height  Weight
A   22      66     140
B   42      70     148
D   35      68     160

In [274]:
df['Age']>22

A    False
B     True
C     True
D     True
E     True
Name: Age, dtype: bool

In [275]:
print("\nRows with Height > 65 inch\n",'-'*35, sep='')
print(df[df['Height']>65])

Rows with Height > 65 inch
-----------------------------------
   Age  Height  Weight
A   22      66     140
B   42      70     148
D   35      68     160

In [276]:
df['Height']>65

A     True
B     True
C    False
D     True
E    False
Name: Height, dtype: bool

In [277]:
booldf1 = df['Height']>65
booldf2 = df['Weight']>145

In [278]:
print("\nRows with Height > 65 inch and Weight >145 lbs\n",'-'*55, sep='')
print(df[(booldf1) & (booldf2)])

Rows with Height > 65 inch and Weight >145 lbs
-------------------------------------------------------
   Age  Height  Weight
B   42      70     148
D   35      68     160

In [279]:
df[(df['Age']>15) & (df['Height']>10)]['Age'] #its series

A    22
B    42
C    30
D    35
E    25
Name: Age, dtype: int32

In [280]:
df[(df['Age']>15) & (df['Height']>10)] [['Age']]#its data frame

   Age
A   22
B   42
C   30
D   35
E   25

In [281]:
df[(df['Age']>15) & (df['Height']>10)] [['Age','Weight']]#its also data frame

   Age  Weight
A   22     140
B   42     148
C   30     125
D   35     160
E   25     152

In [282]:
print("\nDataFrame with only Age and Weight columns whose Height > 65 inch\n",'-'*68, sep='')
print(df[booldf1][['Age','Height']])

DataFrame with only Age and Weight columns whose Height > 65 inch
--------------------------------------------------------------------
   Age  Height
A   22      66
B   42      70
D   35      68

In [283]:
matrix_data = np.matrix('22,66,140;42,70,148;30,62,125;35,68,160;25,62,152')
row_labels = ['A','B','C','D','E']
column_headings = ['Age', 'Height', 'Weight']

In [284]:
df = pd.DataFrame(data=matrix_data, index=row_labels, columns=column_headings)
print("\nThe DataFrame\n",'-'*25, sep='')
print(df)

The DataFrame
-------------------------
   Age  Height  Weight
A   22      66     140
B   42      70     148
C   30      62     125
D   35      68     160
E   25      62     152

In [380]:
print("\nAfter resetting index\n",'-'*35, sep='')
print(df.reset_index())

After resetting index
-----------------------------------
   index Profession  Height  Weight
0      0    Student      66     140
1      1    Teacher      70     148
2      2   Engineer      62     125
3      3     Doctor      68     160
4      4      Nurse      62     152

In [381]:
print("\nAfter resetting index with 'drop' option TRUE\n",'-'*45, sep='')
print(df.reset_index(drop=True))
"Student Teacher Engineer Doctor Nurse".split()

After resetting index with 'drop' option TRUE
---------------------------------------------
  Profession  Height  Weight
0    Student      66     140
1    Teacher      70     148
2   Engineer      62     125
3     Doctor      68     160
4      Nurse      62     152

['Student', 'Teacher', 'Engineer', 'Doctor', 'Nurse']

In [382]:
print("\nAdding a new column 'Profession'\n",'-'*45, sep='')
df['Profession'] = "Student Teacher Engineer Doctor Nurse".split()
print(df)

Adding a new column 'Profession'
---------------------------------------------
  Profession  Height  Weight
0    Student      66     140
1    Teacher      70     148
2   Engineer      62     125
3     Doctor      68     160
4      Nurse      62     152

In [383]:
print("\nSetting 'Profession' column as index\n",'-'*45, sep='')
print (df.set_index('Profession'))

Setting 'Profession' column as index
---------------------------------------------
            Height  Weight
Profession
Student         66     140
Teacher         70     148
Engineer        62     125
Doctor          68     160
Nurse           62     152

In [385]:
# make any column as first column
df=df.set_index('Profession').reset_index()
df

  Profession  Height  Weight
0    Student      66     140
1    Teacher      70     148
2   Engineer      62     125
3     Doctor      68     160
4      Nurse      62     152

In [379]:
#multi-indexing
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))

In [290]:
print("\nTuple pairs after the zip and list command\n",'-'*45, sep='')
print(hier_index)

Tuple pairs after the zip and list command
---------------------------------------------
[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [291]:
hier_index = pd.MultiIndex.from_tuples(hier_index)
print("\nIndex hierarchy\n",'-'*25, sep='')
print(hier_index)

Index hierarchy
-------------------------
MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [292]:
print("\nIndex hierarchy type\n",'-'*25, sep='')
print(type(hier_index))

Index hierarchy type
-------------------------
<class 'pandas.core.indexes.multi.MultiIndex'>

In [293]:
print("\nCreating DataFrame with multi-index\n",'-'*37, sep='')
#np.random.seed(101)
df1 = pd.DataFrame(data=np.round(rn(6,3)), index= hier_index, columns= ['A','B','C'])
print(df1)

Creating DataFrame with multi-index
-------------------------------------
        A    B    C
G1 1  2.0 -1.0 -0.0
   2  1.0 -0.0 -1.0
   3  1.0 -1.0 -1.0
G2 1 -0.0 -0.0  1.0
   2  2.0 -1.0 -1.0
   3 -1.0  1.0 -2.0

In [294]:
#cross tabulation like pivot table

In [295]:
print("\nGrabbing a cross-section from outer level\n",'-'*45, sep='')
print(df1.xs('G1'))

Grabbing a cross-section from outer level
---------------------------------------------
     A    B    C
1  2.0 -1.0 -0.0
2  1.0 -0.0 -1.0
3  1.0 -1.0 -1.0